{
    "AGRID": "alpha-numeric grid identification (<=24 characters).",
    "BARINCFSB": "coefficient of free surface subcritical flow at internal barrier node NBVV(k,j) and the paired node IBCONN(k,j). A typical value is BARINCFSB(k,j) = 1.0.",
    "BARINCFSP": "coefficient of free surface supercritical flow at internal barrier node NBVV(k,j) and the paired node IBCONN(k,j). A typical value is BARINCFSP(k,j) = 1.0.",
    "BARINHT": "internal barrier height (positive above the geoid and negative below the geoid) at node NBVV(k,j) and the paired node IBCONN(k,j)). The barrier height must be greater than the bathymetric depth at these nodes, i.e., recalling the different sign convention between the bathymetric depth and the barrier height, BARINHT(k,j) > –DP(NBVV(k,j) and <b >BARINHT(k,j) > –DP(IBCONN(k,j)). If this is not satisfied, the run will terminate.",
    "BARLANCFSP": "coefficient of free surface supercritical flow at external barrier node NBVV(k,j). A typical value is BARLANCFSP(k,j)= 1.0.",
    "BARLANHT": "external barrier height (positive above the geoid and negative below the geoid) at node NBVV(k,j). The barrier height must be greater than the bathymetric depth at this node, i.e., recalling the different sign convention between the bathymetric depth and the barrier height, BARLANHT(k,j) > –DP(NBVV(k,j). If this is not satisfied, the run will terminate.",
    "BK": "bridge pier shape factor (K – see Table 1 in the section on Bridge Piers)",
    "BALPHA": "fraction of the cross section occupied by all of the piers in the bridge = sum of bridge pier widths/width of cross section (corresponds to",
    "BDELX": "approximate nodal spacing at the location of a bridge in the upstream/downstream direction in meters or feet depending on the grid coordinate system (for lon,lat coordinates, use meters for BDELX). (Note that 2*BDELX if the bridge pier effects are distributed across 3 nodes in the alongstream direction)",
    "DP": "-DREAL8 -DLINUX -DCSCA -DCMPI -DDEBUG_WARN_ELEV",
    "IBCONN": "face node paired with the front face node, NBVV(k,j), on an internal barrier boundary",
    "IBTYPE": "boundary type",
    "=": "|UU|/1000. at bottom varies linear over lower 20% of water column",
    "IBTYPEE": "elevation boundary type, (At present the only allowable value for IBTYPEE is 0). Elevations are specified either in the Model Parameter and Periodic Boundary Condition File for harmonic forcing or in the Non-periodic Elevation Boundary Condition File for time series forcing.",
    "PIPEHT": "cross barrier pipe height in internal barrier with cross barrier pipes.",
    "PIPECOEF": "The bulk pipe friction factor for the internal barrier boundary cross-barrier pipe boundary node pair. This bulk friction factor is defined as: PIPECOEFR = fL/D where f is the classical pipe friction coefficient, L is the length of the pipe through the barrier (in consistent units) and D is the diameter of the cross barrier pipe (in consistent units).",
    "PIPEDIAM": "cross barrier pipe diameter in internal barrier with cross barrier pipes (diameter in units consistent with the mesh).",
    "JE": "element number. The elements must be input in ascending order.",
    "JN": "node number. The nodes must be input in ascending order.",
    "NBDV": "node numbers on elevation specified boundary segment k. The node numbers must be entered in order as one moves along the boundary segment, however the direction (counter clockwise or clockwise around the domain) does not matter.",
    "NBPNODES": "total number of nodes (centerline and adjacent) in ADCIRC grid used to represent the effects of bridge piers",
    "NBNNUM": "node number in the ADCIRC grid of node k used to represent the frictional effects of bridge piers",
    "NBOU": "number of normal flow (discharge) specified boundary segments. These include zero normal flow (land) boundaries, non-zero normal flow (river) boundaries, potentially overflowing external barrier boundaries, potentially overtopping internal barrier boundaries and radiation boundaries. See also General Notes for Normal Flow Boundary Conditions.",
    "NBVV": "node numbers on normal flow boundary segment k. The node numbers must be entered in order as one moves along the boundary segment with land always on the right, i.e., in a counter clockwise direction for external (e.g., mainland, external barrier) boundaries and a clockwise direction for internal (e.g., island, internal barrier) boundaries. For an internal barrier boundary (IBTYPE(k) = 4, 24) only the nodes on the front face of the boundary are specified in NBVV(k,j). The paired nodes on the back face of the boundary are specified in IBCONN(k,j).",
    "NE": "number of elements in the horizontal grid",
    "NETA": "total number of elevation specified boundary nodes",
    "NHY": "number of nodes per element. At present the only allowable value for the number of nodes per element is 3 indicating a triangular element with linear basis functions.",
    "NM": "NM(JE,3) = node numbers comprising element JE. These must be specified in a counter clockwise direction moving around the element.",
    "NOPE": "number of elevation specified boundary forcing segments.",
    "NP": "number of nodes in the horizontal grid",
    "NVDLL": "number of nodes in elevation boundary segment k",
    "NVEL": "total number of normal flow specified boundary nodes including both the front and back nodes on internal barrier boundaries.",
    "NVELL": "number of nodes in normal flow specified boundary segment k. For an internal barrier boundary (IBTYPE 4 or 24), NVELL(k) includes only the nodes on the front face of the boundary as specified in NBVV(k,j) and not the paired nodes on the back face of the boundary specified in IBCONN(k,j).",
    "X": "= X and Y coordinates. If ICS=1 in the Model Parameter and Periodic Boundary Condition File then X(JN), Y(JN) are Cartesian coordinates with units of length (e.g., feet or meters) that are consistent with the definition of gravity in the Model Parameter and Periodic Boundary Condition File. If ICS=2 in the Model Parameter and Periodic Boundary Condition File then X(JN), Y(JN) are spherical coordinates in degrees of longitude (east of Greenwich is positive and west of Greenwich is negative) and degrees of latitude (north of the equator is positive and south of the equator is negative)",
    "RUNDES": "alpha-numeric run description 1 (<=32 characters)",
    "RUNID": "alphanumeric run description 2 (<= 24 characters)",
    "NFOVER": "non-fatal error override option;",
    "Note": "NFOVER:",
    "Occasionally,": "elevation solution becomes unphysically large due to improper numerical parameter settings, time step stability criteria violation. It can be useful for ADCIRC to terminate based on a user-specific limit to the computed water elevation. To enable this feature, ADCIRC must be compiled with the DEBUG_WARN_ELEV compiler directive. This is set in the cmplrflags.mk file. For example, for the serial model,",
    "DA": "-DREAL8 -DLINUX -DCSCA –DDEBUG_WARN_ELEV",
    "and": "the parallel model:",
    "This": "cause ADCIRC to warn when the water elevation exceeds 10 meters, no global elevation files will be written, and ADCIRC will terminate if 100 warnings are generated OR the elevation exceeds 30 meters.",
    "NFOVER,": "iWarnElevDump, WarnElevDumpLimit, ErrorElev",
    "ADCIRC": "monitors the maximum water elevation and behaves as follows:",
    "A": "elevation file (written to fort.69) will be written if WarnElev is exceeded AND iWarnElevDump == 1",
    "Execution": "be terminated if elevation exceeds ErrorElev.",
    "The": "wave model is dynamically coupled to the ADCIRC model. Radiation stresses and currents from the SWAN model are applied in addition to meteorological forcing. The meteorological input is specified by: SIGN(NWS)*(ABS(NWS)-300). For example, NWS=300 means include wave radiation stress with no meteorological forcing (NWS=0); NWS=301 means include wave radiation stress plus meteorological forcing corresponding to NWS=1; NWS=-304 means include wave radiation stress plus meteorological forcing corresponding to NWS=-4, etc. Wave radiation stress are computed by the SWAN model every RSTIMINC seconds and passed into ADCIRC. In addition to assigning RSTIMINC the user must have a SWAN input and control file (fort.26) in the same working directory as the fort.15 ADCIRC control file.",
    "WarnElev": "20.0 ! Warn at 20 meters",
    "iWarnElevDump": "0 ! Do not write global elevation files",
    "WarnElevDumpLimit": "50 ! Terminate execution if the warning level is reached 50 times",
    "ErrorElev": "1000.0 ! Terminate execution of the water elevation exceeds 1000 meters",
    "Example:": "override the defaults, recompile ADCIRC as above, and modify the NFOVER line in the fort.15 file:",
    "1": "EV = EVCON",
    "NABOUT": "Logging level for output from ADCIRC to the screen or console as well as the ADCIRC log file (fort.16). ADCIRC writes log messages at 5 levels of severity: DEBUG, ECHO, INFO, WARNING, and ERROR (from lowest or least important to highest or most important). Selection of a logging level indicates that messages of that level and higher should be logged. Setting the logging level to WARNING or ERROR will reduce the size (and clutter) in the log files, but important information could be missed. ERROR messages generally result from problems that also cause the run to stop.",
    "NABOUT=-1::": "log messages and higher. This may consume a lot of disk space and slow ADCIRC down, perhaps dramatically. Generally only useful for ADCIRC developers.",
    "NABOUT=0::": "log messages and higher. ECHO-level log messages include echo printing of most input files including the fort.13, fort.14 and fort.22 files.",
    "NABOUT=1::": "log messages and higher. These messages inform the user about something that ADCIRC has done that is important but is not the result of a problem or issue.",
    "NABOUT=2::": "log messages and higher. These messages indicate a potential problem that is generally not fatal to the run.",
    "NABOUT=3::": "log messages only. These messages indicate a severe problem that usually causes the run to stop.",
    "Prior": "ADCIRC version 49, 0 (ECHO) and 1 (INFO) were the only available options. NABOUT originally stood for “Abbreviated Output” (to log files).",
    "NSCREEN": "Controls log message output to the screen (i.e., to standard output). Timestep logging will be written every abs(NSCREEN) timesteps. Output to the screen consists mainly of timestep logging.",
    "NSCREEN<0::": "messages that would normally be wrtten to the screen are written to a file called adcirc.log instead.",
    "NSCREEN=0::": "messages will not be written to the screen.",
    "NSCREEN>0::": "messages are written to the screen (a.k.a. standard out).",
    "IHOT": "parameter controlling whether the model is hot started. The hotstart facility is available for 2D and 3D runs. The hotstart file will also contain harmonic analysis data if harmonic analysis was underway, so that the harmonic analysis can be hotstarted as well.",
    "ICS": "parameter controlling whether the model is run in spherical or Cartesian coordinates.",
    "IM": "model type",
    "IDEN": "form of density forcing in a 3D run (for all Baroclinic model runs, the initial density, temperature and/or salinity field is read in from UNIT 11); ADCIRC does not support 2D baroclinic model runs.",
    "=-4": "Baroclinic ADCIRC run with Salinity and Temperature forcing",
    "=-3": "Baroclinic ADCIRC run with Temperature forcing",
    "=-2": "Baroclinic ADCIRC run with Salinity forcing",
    "=-1": "Baroclinic ADCIRC run with Sigma T forcing",
    "=0": "model run",
    "=1": "Baroclinic ADCIRC run with Sigma T forcing",
    "=2": "Baroclinic ADCIRC run with Salinity forcing",
    "=3": "Baroclinic ADCIRC run with Temperature forcing",
    "=4": "Baroclinic ADCIRC run with Salinity and Temperature forcing",
    "NOLIBF": "parameter controlling the type of bottom stress parameterization used in a 2DDI ADCIRC run. This parameter must be specified but is ignored in a 3D run. Note: In the NWP section, if the user selects quadratic_friction_coefficient_at_sea_floor, mannings_n_at_sea_floor, or chezy_friction_coefficient_at_sea_floor, then NOLIBF must be 1 (nonlinear friction formulation) since all those formulations are nonlinear. If the NOLIBF were anything other than 1, it is an error that will cause ADCIRC to stop.",
    "For": "attributes bottom_roughness_length and mannings_n_at_the_sea_floor, the bottom roughness length is read in from the nodal attribute file either directly or as a Manning’s n roughness. Currently Z0B is not used for either of these two cases.",
    "NOLIFA": "parameter controlling the finite amplitude terms in ADCIRC. The value of NOLIFA effects the meaning of the minimum water depth parameter(H0) and requires the specification of additional parameters together with H0, (see below). When the finite amplitude terms are turned on, the time derivative portion of the advective terms should also be turned on for proper mass conservation and consistency (i.e. when NOLIFA>0, then NOLICAT=1).",
    "NOLICA": "parameter controlling the advective terms in ADCIRC (with the exception of a time derivative portion that occurs in the GWCE form of the continuity equation and is controlled by NOLICAT). When these (spatial derivative) portions of the advective terms are included, the time derivative portion of the advective terms in the GWCE should also be included (i.e. when NOLICA=1, NOLICAT=1).",
    "NOLICAT": "parameter controlling the time derivative portion of the advective terms that occurs in the GWCE form of the continuity equation in ADCIRC. The remainder of the advective terms in the GWCE and the entire advective terms in the momentum equation are controlled by NOLICA. These terms should be included if either the finite amplitude or the remainder of the advective terms are included to maintain mass conservation and solution consistency.",
    "NWP": "Number of nodal attributes used in the run. Nodal attributes are properties of each node in the grid and are spatially varying but constant in time. See AttrName for examples. The nodal attribute data itself must be provided by the user in the Nodal Attributes File (fort.13). If NWP is not zero, then the names of the nodal attributes appear on the following lines, one per line:",
    "FOR": "to NWP",
    "AttrName": "nodal attribute name, the fort.13 file must contain data for all AttrNames that appear in the fort.15 file. Valid names followed by the ADCIRC variable are:",
    "end": "loop",
    "NCOR": "parameter controlling whether the Coriolis parameter is constant in space and read in below or spatially varying as computed from the y-coordinates of the nodes in the grid (assumed to be in degrees Latitude). The grid coordinate system is specified by the ICS parameter (see above).",
    "NTIP": "parameter controlling whether tidal potential and self attraction/load tide forcings will be used to force ADCIRC.",
    "NWS": "parameter controlling whether wind velocity or stress, wave radiation stress and atmospheric pressure are used to force ADCIRC.",
    "=-4,": "velocity and atmospheric pressure are read in (PBL/JAG format) at selected ADCIRC grid nodes from the Single File Meteorological Forcing Input File. It is assumed that the first entry in the Single File Meteorological Forcing Input File corresponds to the time that the current model run is started. Specifically, if the model is hot started, it is assumed that first entry in the Single File Meteorological Forcing Input File corresponds to the model hot start time. Succeeding entries in the Single File Meteorological Forcing Input File occur at the time interval (WTIMINC) specified below. Interpolation in time is used to synchronize the wind and pressure information with the model time step. Garret’s formula is used to compute wind stress from wind velocity.",
    "=-5,": "velocity and atmospheric pressure are read in at all grid nodes from the Single File Meteorological Forcing Input File. It is assumed that the first entry in the Single File Meteorological Forcing Input File corresponds to the time that the current model run is started. Specifically, if the model is hot started, it is assumed that first entry in the fort.22 file corresponds to the model hot start time. Succeeding entries in the Single File Meteorological Forcing Input File occur at the time interval (WTIMINC) specified below. Interpolation in time is used to synchronize the wind and pressure information with the model time step. Garret’s formula is used to compute wind stress from wind velocity.",
    "=-7,": "stress and pressure values are read in on a regular grid from the Single File Meteorological Forcing Input File. It is assumed that the first entry in the Single File Meteorological Forcing Input File corresponds to the time that the current model run is started. Specifically, if the model is hot started, it is assumed that first entry in the fort.22 file corresponds to the model hot start time. Succeeding entries in the Single File Meteorological Forcing Input File occur at the time interval (WTIMINC) specified below. Interpolation in time is used to synchronize the wind and pressure information with the model time step.",
    "=10,": "velocity (10 m) and atmospheric pressure are read in from a sequence of National Weather Service (NWS) Aviation (AVN) model output files. Each AVN file is assumed to contain data on a Gaussian longitude, latitude grid at a single time. Consecutive files in the sequence are separated by N hours in time (where N=WTIMINC/3600 and WTIMINC is read in below). The files are named using the convention: fort.200 – wind & pressure at the time of a model hot start (this file is not used for a cold start); fort.XX1 (where XX1=200+1*N) – wind & pressure N hours after a cold or hot start; fort.XX2 (where XX2=200+2*N) – wind & pressure 2N hours after a cold or hot start; fort.XX3 (where XX3=200+3*N) – wind & pressure 3N hours after a cold or hot start and so on for all meteorological files. Prior to ADCIRC version 34.05 these files were in binary and created from a larger Grib form file using the program UNPKGRB1. Starting with ADCIRC version 34.05, the files are in ASCII tabular format. If ADCIRC is hot started, it must be done at an even N hour interval so that the hot start time corresponds to the time of a meteorological file. Enough meteorological files must be present to extend through the ending time of the model run. Garret’s formula is used to compute wind stress from the wind velocity.",
    "=11,": "velocity (10 m) and atmospheric pressure are read in from a sequence of stripped down National Weather Service (NWS) ETA 29km model output files. Each ETA file is assumed to contain data on an E grid for a single day (8 data sets, one every 3 hours, beginning @ 03:00 and continuing through 24:00 of the given day). The files are named using the convention: fort.200 – wind & pressure the day before a model run is hot started. The final data in this file are used as the initial met condition for the hot start. This file is not used for a cold start. fort.201 – wind & pressure during the first day after a cold or hot start. fort.202 – wind & pressure during the second day after a cold or hot start fort.203 – wind & pressure during the third day after a cold or hot start. This sequence continues for all meteorological files. These files are in binary and have the format described below. The wind data is converted to an east-west, north-south coordinate system inside ADCIRC. If the model is hot started, it must be done at an even day interval so that the hot start time corresponds to the time of a meteorological file. Enough meteorological files must be present to extend through the ending time of the model run. Garret’s formula is used to compute wind stress from the wind velocity.",
    "=12,": "velocity (10 minute averaged winds at 10m) and atmospheric pressure are provided in the OWI format on one or two rectangular (lat/lon) grid(s). If two grids are used, the first is designated as the large (“basin”) scale grid, and the second is designated as the small (“region”) scale grid. The Single File Meteorological Forcing Input File (fort.22) is only used to specify a few configuration parameters, while the actual wind fields are recorded in files named fort.221, fort.222, fort.223, and fort.224 (with fort.223 and fort.224 being optional). The time increment of the meteorological forcing is specified through WTIMINC in the fort.15 file. The wind and pressure fields are interpolated in space onto the ADCIRC grid and in time to synchronize the wind and pressure information with the model time step. Garret’s formula is used to compute wind stress from wind velocity.",
    "=15,": "files are data assimilated snapshots of the wind velocity fields of tropical cyclones that are produced by the NOAA Hurricane Research Division (HRD). If the NWS value is set to +15, the hours column in the associated meterological forcing input file (fort.22) is relative to the cold start time. If NWS is set to -15, that hours column is relative to the hot start time. Please see the documentation of the Single File Meteorological Forcing Input File for complete details..",
    "=19,": "has the ability to select which Isotach to use in each of the 4 quadrants. User also has ability to modify RMAX and Holland’s B parameter using the ASWIP program. The auxiliary preprocessing program ASWIP.F (located in the /wind directory and executable is created by typing, make aswip, in the work folder after adcirc executable has been generated), will generate the fort.22 input file for NWS=19 from a NWS= 9 formatted input file.",
    "Hurricane": "are read in from the Single File Meteorological Forcing Input File. It is assumed that the line in the Single File Meteorological Forcing Input File with a zero as the forecast increment (i.e., column 6) corresponds to the start of the current simulation run, whether it is a hotstart or cold start. In other words, there is no option to set the NWS value negative to indicate that the file starts at the ADCIRC hotstart time. Rather, the forecast increment in hours (column 6) is used to indicate the relationship between the ADCIRC time and the data in the fort.22 file. Wind velocity and atmospheric pressure are calculated at exact finite element mesh node locations and directly coupled to ADCIRC at every time step using the asymmetric hurricane vortex formulation (Mattocks et al, 2006; Mattocks and Forbes, 2008) based on the Holland gradient wind model. The input file is assumed to correspond to the ATCF Best Track/Objective Aid/Wind Radii Format. Historical tracks, real-time hindcast tracks and real-time forecast tracks may be found in this format. This option uses the radii at specific wind speeds (34, 50, 64, 100 knots) reported in the four quadrants (NE, SE, SW, NW) of the storm to calculate the radius of maximum winds as a function of the azimuthal angle. Garret’s formula is used to compute wind stress from the wind velocity. The NWS=19 option allows the user to set a value for Rmax and Holland B Parameter. Additionally the user can select the isotachs to be used for each of the 4 quadrants. The utility program aswip_1.0.3.F located in the /wind folder will generate the NWS=19 fomatted file from a NWS=9 formatted fort.22 input file.",
    "In": "to use the NWS=19 option, the file needs to be in best track format. The forecast period (column #6) needs to be edited to reflect the time of the forecast/nowcast for each track location (each line) in hours from the start of the simulation (0, 6, 12, 18, etc). There is no -19 option to indicate that the hours in column 6 are relative to the hotstart time. For the dynamic asymmetric model (NWS=19), ADCIRC always assumes that hour 0 corresponds to when the model is started, whether that is a cold start or a hot start. Therefore, ADCIRC analysts should not attempt to set NWS to -19. The original data in that column depends on what type of best track format data is being used. The original data might have 0 or other numbers in that column. See: http://www.nrlmry.navy.mil/atcf_web/docs/database/new/abrdeck.html It is suggested that users change the “BEST” tech type to “ASYM” in column 5 in the fort.22 file to denote that the file has been modified to accommodate the asymmetric wind formulation (the simulation time in hours in the 6th column has been added, etc.) so it will not get confused in the future with a best track file.",
    "o": "Column 39 is the Holland B parameter computed using the formulas outlines in the Holland paper, and implemented using the aswip program.",
    "=20,": "Asymmetric Holland Model (GAHM) Format. The track file format is similar to that of the older Dynamic Asymmetric Model (NWS = 19) but with 8 additional columns of data. See notes in the fort.22 file for more information. The theory and implementation of the GAHM was initially described at the 2013 ADCIRC Users Group Meeting.",
    "=100,": "102, -102, 103, 104, -104, 105, -105, 106, 110, 111, wave radiation stress is applied in addition to meteorological forcing. The meteorological input is specified by: SIGN(NWS)*(ABS(NWS)-100). For example, NWS=100 means include wave radiation stress with no meteorological forcing (NWS=0); NWS=101 means include wave radiation stress plus meteorological forcing corresponding to NWS=1; NWS=-104 means include wave radiation stress plus meteorological forcing corresponding to NWS=-4, etc. Wave radiation stress is read from a Wave Radiation Stress Forcing File. The format of this file is similar to the generic meteorological forcing file when NWS=-4 with the exception that no pressure values are read in. The time increment between consecutive radiation stress fields (RSTIMINC) is specified below.",
    "=300,301,302,": "303, 304, -304, 305, -305, 306, 310, 311, 312, -312, NWS values in the 300’s indicate a SWAN+ADCIRC run Note padcswan or adcswan must be precompiled to use this option.",
    "NRAMP": "ramp option parameter controlling whether a ramp is applied to ADCIRC forcing functions.",
    "G": "gravitational constant. The units of this constant determine the distance units that ADCIRC operates with. (ADCIRC always operates in seconds and therefore the time units for G must be seconds.) When ICS = 2, it is required that G = 9.81 m/sec2. Regardless of ICS, when either NTIP = 1 or NCOR = 1, it is required that G = 9.81 m/sec2.",
    "TAU0": "= Generalized Wave-Continuity Equation (GWCE) weighting factor that weights the relative contribution of the primitive and wave portions of the GWCE. If “primitive_weighting_in_continuity_equation” is specified as a nodal attribute in the fort.15 file above, this line will be read in but ignored. If a nodal attribute file is not used or “primitive_weighting_in_continuity_equation” is in the nodal attribute (fort.13) file, but not specified in the fort.15 file this TAU0 parameter will be used.",
    "<": "= The predictor-corrector algorithm is used.",
    "if": ">= 0.025; TAU0 = TAU0Base + 1.5 TK(i) where TK(i)=Cd|U|/H",
    "TAU0Base": "can be generated with the ADCIRC utitlity program tau0_gen.f. The program bases generation on the following logic:",
    "If": "Manning’s n roughness is read in, the roughness length is expressed in terms of the water depth H and the Manning’s n:",
    "Tau0=Tau0Min+1.5*TK": "",
    "Tau0FullDomainMin,": "– include this line only if TAU0= -5 – specified values that the spatially and time varying TAU0 scheme must stay between. Suggested values are Tau0FullDomainMin = 0.005 and Tau0FullDomainMax = 0.2.",
    "DTDP": "ADCIRC time step (in seconds). Note: time in the model is computed as: TIME = STATIM*86400.+DTDP*IT.",
    ">": "= The predictor-corrector algorithm is not used.",
    "STATIM": "starting simulation time (in days). The first time step computes results at: TIME = STATIM*86400+DTDP. A nonzero value may be useful, for example, to align model output times with a specific time reference.",
    "REFTIM": "reference time (in days). This is used only to compute time for the harmonic forcing and analysis terms. A nonzero value allows equilibrium arguments to be used that have been calculated for a time other than TIME0 = STATIM*86400. The time used for harmonic terms is compute as: TIMEH = (STATIM–REFTIM)*86400.+DTDP*IT.",
    "POAN": "that weights bridge pier drag between adjacent and centerline nodes.",
    "WTIMINC": "Time increment between meteorological forcing data sets (in seconds). This parameter and the line on which it appears depends on the value of the NWS parameter. See the Supplemental Meteorological/Wave/Ice Parameters table for details.",
    "YYYY,MM,DD,HH24,StormNumber,BLAdj": "for the Dynamic Holland model (NWS=8) and the Dynamic Asymetric Model (NWS=19), this is the coldstart datetime, the number of the storm in forecast ensemble, and the boundary layer adjustment factor. The datetime tells ADCIRC what time corresponds to t=0. For example, if the datetime is specified as 2005 08 29 06 on a cold start, then ADCIRC will find that time in the Single File Meteorological Forcing Input File, linearly interpolating if necessary, to get its initial wind state. For a hotstart, the time in the hotstart file will be added to this datetime before seeking the proper place in the Single File Meteorological Forcing Input File. For example, if the coldstart datetime is still specified as 2005 08 29 06, and the time in the hotstart file is 86400 seconds, ADCIRC will start up and interpolate in the Single File Meteorological Forcing Input File for the conditions at 6:00 am on August 30, 2005 to get its hotstart wind state. One limitation is that an ADCIRC run cannot cross the boundary of the calendar year, i.e. start in December and end in January. StormNumber is an integer and should be set to 1. BLAdj is the adjustment factor between wind speed at 10m and the wind speed at the top of the atmospheric boundary layer (winds at top of atm. b.l.)=(winds at 10m)/BLAdj. Reasonable range is 0.7 to 0.9.",
    "RSTIMINC": "time interval (in seconds) between successive wave radiation stress values in the Wave Radiation Stress Forcing File. This value must be specified in the Model Parameter and Periodic Boundary Condition File if the absolute value of NWS >=100.",
    "IREFYR,": "IREFDAY, IREFHR, IREFMIN, REFSEC = starting time parameters for a Single File Meteorological Forcing Input File in US Navy Fleet Numeric format (NWS = 3, 103). These values are used in ADCIRC to compute WREFTIM which is the start time of the simulation in seconds since the beginning of the calendar year. ADCIRC is configured to accept only 1 calendar year’s data, i.e., it is not possible to combine Fleet Numeric met data from two different years into a single file and then run.",
    "IREFYR": "year of the start of the simulation",
    "IREFMO": "month of the start of the simulation",
    "IREFDAY": "day of the start of the simulation",
    "IREFHR": "hour of the start of the simulation",
    "IREFMIN": "minute of the start of the simulation",
    "REFSEC": "second of the start of the simulation.",
    "NWLAT,": "WLATMAX, WLONMIN, WLATINC, WLONINC = parameters describing the spatial structure of a Single File Meteorological Forcing Input File where met data is set up on a simple rectangular grid (NWS = 3, 6, 103, 106).",
    "NWLAT": "number of latitude values in the met file.",
    "NWLON": "number of longitude values in met file.",
    "WLATMAX": "maximum latitude (decimal deg) of data in met file (< 0 south of the equator).",
    "WLONMIN": "minimum longitude (decimal deg) of data in the met file (< 0 west of Greenwich meridian).",
    "WLATINC": "latitude increment (decimal deg) of data in the met file (must be > 0).",
    "WLONINC": "longitude increment (decimal deg) of data in the met file (must be > 0).",
    "RNDAY": "length of the ADCIRC run (in decimal days)",
    "DRAMP": "value (in decimal days) used to compute the ramp function that ramps up ADCIRC forcings from zero (if NRAMP=1). The ramp function is computed as RAMP=tanh(2.0*IT*DTDP/(86400.*DRAMP)) where IT = the time step number since the beginning of the model run. DRAMP is equal to the number of days when RAMP=0.96.",
    "DRAMPExtFlux": "value (in decimal days) used to compute the ramp function that ramps up the nonzero external flux boundary condition.",
    "FluxSettlingTime": "time in days that it takes for the river flux boundary condition and the river bottom friction to equilibrate so the water surface elevation can find its steady state.",
    "Notes:": "",
    "DRAMPIntFlux": "value (in decimal days) used to compute the ramp function that ramps up the nonzero internal flux boundary condition.",
    "DRAMPElev": "value (in decimal days) used to compute the ramp function that ramps up the elevation-specified boundary condition.",
    "DRAMPTip": "value (in decimal days) used to compute the ramp function that ramps up the tidal potential.",
    "DRAMPMete": "value (in decimal days) used to compute the ramp function that ramps up the wind and atmospheric pressure.",
    "DRAMPWRad": "value (in decimal days) used to compute the ramp function that ramps up the wave radiation stress.",
    "DUnRampMete": "meteorological ramp delay parameter with units of decimal days. It simply delays the application of the meteorological ramp for the specified length of time, relative to the ADCIRC cold start time.",
    "A00,": "= time weighting factors (at time levels k+1, k, k-1, respectively) in the GWCE",
    "H0": "minimum water depth",
    "IF": "= 2, coordinates are input as degrees longitude and latitude",
    "INTEGER": "In the past, the wetting and drying algorithm required two additional integers as input. These extra parameters are no longer needed by the code, but they are still present to maintain backward compatibility. Their values will be ignored.",
    "VELMIN": "minimum velocity for wetting. A dry node wets if a water surface slope exists that would drive water from a currently wet node to the dry node and the steady-state current velocity that resulted would have a velocity > VELMIN. This parameter helps to keep nodes/elements from repeatedly turning on and off during the wetting process. A typical value might be 0.05 m/s.",
    "SLAM0,SFEA0": "longitude and latitude on which the CPP coordinate projection is centered (in degrees) if ICS = 2.",
    "TAU": "bottom friction is a linear function of depth-averaged velocity and TAU is the corresponding linear friction coefficient (units of 1/sec). In this case it is strongly recommended that TAU0 = TAU (Used with NOLIBF = 0). If some type of spatially varying bottom friction is specified in the NWP section, this input is ignored, and the friction coefficients will be read in from the nodal attributes file.",
    "CF": "2DDI quadratic bottom friction coefficient (dimensionless) with the following specific meanings (note, for clarity, the quadratic friction coefficient name in the ADCIRC source code is FFACTOR):",
    "HBREAK": "the break depth (units of length) utilized for NOLIBF = 2. If the water depth (H) is greater than HBREAK, bottom friction approaches a quadratic function of depth-averaged velocity with FFACTOR = CF. If the water depth is less than HBREAK, the friction factor increases as the depth decreases (e.g. like a manning type friction law). (HBREAK = 1 m is recommended).",
    "FTHETA": "a parameter (dimensionless) utilized in the hybrid bottom friction relationship (NOLIBF = 2) that determines how rapidly the hybrid bottom friction relationship approaches its deep water and shallow water limits when the water depth is greater than or less than HBREAK. (FTHETA = 10 is recommended).",
    "FGAMMA": "a parameter (dimensionless) utilized in the hybrid bottom friction relationship (NOLIBF = 2) that determines how the friction factor increases as the water depth decreases. Setting this to 1/3 gives a manning friction law type of behavior (FGAMMA = 1/3 is recommended).",
    "ESLM": "Spatially constant horizontal eddy viscosity for the momentum equations (units of length2/time)",
    "ESLC": "Spatially constant horizontal eddy diffusivity for the transport equation (units of length2/time). This is only specified if IM = 10.",
    "CORI": "Constant Coriolis coefficient. This value is always read in, however it is only used in the computations when NCOR = 0.",
    "NTIF": "number of tidal potential constituents",
    "TIPOTAG": "description of TPK(I),AMIGT(I),ETRF(I),FFT(I) and FACET(I)",
    "TPK": "tidal potential amplitude, frequency, earth tide potential reduction factor (generally taken to be 0.690 for all constituents (Hendershott) but for more precise calculations can take on slightly different values (e.g. see Wahr, 1981)), nodal factor and equilibrium argument in degrees. These values are preceded by TIPOTAG(I) which is an alphanumeric descriptor (i.e. the constituent name)",
    "NBFR": "number of periodic forcing frequencies on elevation specified boundaries. if NBFR=0 and a nonzero number of elevation specified boundary segments are included in the Grid and Boundary Information File, the elevation boundary condition is assumed to be non-periodic and will be read in from the Non-periodic Elevation Boundary Condition File. For reasons of backward compatability, NBFR is included in the Model Parameter and Periodic Boundary Condition File regardless of whether any elevation specified boundaries (IBTYPE=0) are defined in the fort.14 input.",
    "BOUNTAG": "description of AMIG(k),FF(k),FACE(k)",
    "AMIG": "; forcing frequency, nodal factor, equilibrium argument in degrees for tidal forcing on elevation specified boundaries. These values are preceded by BOUNTAG(k), an alphanumeric descriptor (i.e. the constituent name)",
    "ALPHA:": "description of QNAM(k,j),QNPH(k,j) (<=10 characters)",
    "EMO": ", j=1,NETA ; amplitude and phase (in degrees) of the harmonic forcing function at the elevation specified boundaries for frequency k and elevation specified boundary forcing node j. NOTE that the parameter NETA is defined and read in from Grid and Boundary Information File: the forcing values are preceded by an alphanumeric descriptor EALPHA to facilitate verifying that the correct data matches a given frequency.",
    "ANGINN:": "boundary nodes which are set up to have a normal flow essential boundary condition and have an inner angle less than ANGINN (specified in degrees) will have the tangential velocity zeroed. In either case, the normal velocity will be determined from the essential boundary condition.",
    "NFFR": "number of frequencies in the specified normal flow external boundary condition. If NFFR=0 or NFFR=-1, the normal flow boundary condition is assumed to be non-periodic and will be read in from the Non-periodic, Normal Flux Boundary Condition File. If NFFR=0, ADCIRC assumes that the flux data in that file start at the cold start time; but if NFFR=-1, ADCIRC assumes that the flux data in that file start at the hot start time. On the other hand, positive integer values of NFFR indicate the number of frequency components that make up the periodic flux boundaries.",
    "FBOUNTAG": "description of FAMIGT(k),FFF(k),FFACE(k)",
    "FAMIGT": "; forcing frequency, nodal factor, equilibrium argument in degrees for periodic normal flow forcing on flow boundaries. These values are preceded by FBOUNTAG(k), an alphanumeric descriptor (i.e. the constituent name)",
    "QNAM": "k=1,NFFR, j=1,NFLBN; amplitude and phase (in degrees) of the periodic normal flow/unit width (e.g. m2/s) for frequency I and “specified normal flow” boundary node j. A positive flow/unit width is into the domain and a negative flow/unit width is out of the domain. Note: the forcing values are preceded by an alphanumeric descriptor ALPHA to facilitate verifying that the correct data matches a given frequency.",
    "ENAM": "k=1,NFFR, j=1,NFLBN; amplitude and phase of outgoing wave in IBTYPE=32 boundary condition (in degrees).",
    "NOUTE,": "TOUTFE, NSPOOLE = output parameters which control the time series output provided for elevations solutions at selected elevation recording stations (fort.61 output)",
    "NOUTE": "3 Output is provided at the selected elevation recording stations in netCDF format. Following a hot start, continued output is merged into the existing fort.61.nc file.",
    "NSTAE": "the number of elevation recording stations (this is always read in regardless of the value of NOUTE)",
    "XEL": "k=1,NSTAE ; the coordinates of the elevation recording station k, for all NSTAE stations.",
    "NOUTV,": "NSPOOLV = output parameters which control the time series output provided for velocity solutions at selected velocity recording stations (fort.62 output)",
    "NOUTV": "3 Output is provided at the selected velocity recording stations in netCDF format. Following a hot start, continued output is merged into the existing fort.62.nc file.",
    "NSTAV": "the number of velocity recording stations (this is always read in regardless of the value of NOUTV)",
    "XEV": "k=1,NSTAV ; the coordinates of the velocity recording station k, for all NSTAV stations",
    "NOUTC,TOUTSC,": "= output parameters which control the time series output provided for concentration solutions at selected concentration recording stations (fort.91 output)",
    "NOUTC": "2 output is provided at the selected concentration recording stations in binary format. Following a hot start, continued output is merged into the existing fort.91 file.",
    "Note:": "typically use CONVCR=1E-10. After the first few time steps, the solutions usually converge within 5-10 iterations.",
    "NSTAC": "the number of concentration recording stations Note: this line is only read in if transport is included in the model run (i.e. IM=10) Note: this is read in even if NOUTC=0",
    "XEC": "; the coordinates of the concentration recording station k, for all NSTAC stations.",
    "NOUTM,TOUTSM,TOUTFM,NSPOOLM": "output parameters which control the time series output provided for met data at selected met recording stations (units 71&72 output)",
    "NOUTM": "3 Output is provided at the selected met recording stations in netCDF format. Following a hot start, continued output is merged into the existing fort.71.nc&72.nc files.",
    "NSTAM": "the number of meteorological recording stations. Note: this line is only read in if met forcing is included in the model run (i.e. NWS<>0 and NWS<>100). Note: this is read in even if NOUTM=0",
    "XEM": "; the coordinates of the meteorological recording station I, for all NSTAM stations.",
    "NOUTGE,TOUTSGE,TOUTFGE,NSPOOLGE=output": "which control the time series output provided for global elevation solutions at all nodes within the domain (fort.63 output)",
    "NOUTGE": "4 Global elevation output is provided in sparse ascii format. Following a hot start, continued output is merged into the existing fort.63 file.",
    "NOUTGV,TOUTSGV,TOUTFGV,NSPOOLGV=output": "which control the time series output provided for global velocity solutions at all nodes within the domain (fort.64 output)",
    "NOUTGV": "4 Global velocity output is provided in sparse ascii format. Following a hot start, continued output is merged into the existing fort.64 file.",
    "NOUTGC,TOUTSGC,TOUTFGC,NSPOOLGC": "output parameters which control the time series output provided for global concentration solutions at all nodes within the domain (fort.93 output)",
    "NOUTGC": "3 Global concentration output is provided in sparse ascii format. Following a hot start, continued output is merged into the existing fort.93 file.",
    "NOUTGW,": "TOUTFGW, NSPOOLGW = output parameters which control the time series output provided for wind stress or velocity and atmospheric pressure at all nodes within the domain (fort.73 and 74 output)",
    "NOUTGW": "4 Global wind stress/velocity and atmospheric pressure output are provided in sparse ascii format. Following a hot start, continued output is merged into the existing fort.73 and 74 files.",
    "NFREQ": "number of frequencies included in harmonic analysis of model results. Note: harmonic output is only available for 2DDI elevation and velocity",
    "NAMEFR": "an alphanumeric descriptor (i.e. the constituent name) whose length must be <= 10 characters",
    "HAFREQ": "HAFACE(k) k=1,NFREQ = parameters describing the constituents to be included in the harmonic analysis of model results",
    "THAS,": "NHAINC, FMV = parameters that control the calculation of harmonic constituents both at stations and globally",
    "FMV": "1.0 – compute means and vars. over entire period used in harmonic analysis",
    "NHASE,": "NHAGE, NHAGV = parameters that control the spatial locations where harmonic analysis is performed",
    "NHASE": "1 harmonic analysis is performed at the selected elevation recording stations (output on fort.51) Note: the stations are as specified in the section on time series station elevation output",
    "NHASV": "1 harmonic analysis is performed at the selected velocity recording stations (output on fort.52) Note: the stations are as specified in the section on time series station velocity output",
    "NHAGE": "1 harmonic analysis is performed for global elevations (output on fort.53)",
    "NHAGV": "1 harmonic analysis is performed for global velocities (output on fort.54)",
    "NHSTAR,": "= parameters that control the generation of hot start output.",
    "NHSTAR": "5 hot start output files generated in netCDF4 format",
    "ITITER,": "CONVCR, ITMAX = parameters that provide information about the solver that will be used for the GWCE.",
    "ITITER": "1 use iterative JCG solver (from ITPACKV 2D)",
    "ISLDIA": "5 original system from ITPACKV 2D (fort.33)",
    "ISLIP": "3, quadratic slip b.c.",
    "KP": "3D bottom friction coefficient used in ADCIRC",
    "Z0S,Z0B": "free surface & bottom roughnesses",
    "where": "= 0.4 is the von Karman constant, and g is the gravitational acceleration (Bretschneider et al., 1986). New roughness lengths are computed at each time step, based on the computed water depth and Manning’s n value at each mesh vertex.",
    "ALP1,ALP2,ALP3": "time weighting coefficients for the 3D velocity solution.",
    "0.=": "explicit, 0.5=time centered, 1.= fully implicit",
    "ALP1": "the Coriolis term",
    "ALP2": "the bottom friction terms",
    "ALP3": "the vertical diffusion terms",
    "IGC,": "= vertical grid code, # nodes in the vertical grid",
    "IGC": "6, sine grid generated",
    "IEVC,": "EVCON = vertical eddy viscosity code, vertical eddy viscosity minimum value and vertical eddy viscosity constant",
    "NOTE:": "this EV formulation, EVCON is not used.",
    "IEVC": "EV computed from Mellor-Yamada L2.5 closure with parameterizations to include enhanced mixing in the surface layer.",
    "0": "vertical eddy viscosity read in – EVCON is not used",
    "10": "EV = omega*h*h/10 over the entire water column",
    "11": "EV = omega*h*h/1000 at bottom varies linear over lower 20% of water column",
    "NOTE:For": "vertical eddy viscosity formulation, EVCON is not used and omega is hardwired for a 12.42 hour tide.",
    "20": "EV = 0.41U*Zo at bottom",
    "21": "EV = 0.41U*Zo at bottom",
    "WHERE:": "is depth averaged velocity",
    "30": "EV = 0.025|U|h/9.001 over entire water column",
    "31": "EV = EVCON |U|h over entire water column",
    "32": "EV = 0.025|U|h/9.001 in upper 80% of water column",
    "33": "EV = EVCON |U|h in upper 80% of water column",
    "40": "EV = 2|UU|/9.001 over entire water column",
    "41": "EV = EVCON |UU| over entire water column",
    "42": "EV = 2|UU|/9.001 in upper 80% of water column",
    "43": "EV = EVCON |UU| in upper 80% of water column",
    "EVTOT": "eddy viscosity associated with vertical grid node K",
    "THETA1,": "– time weighting coefficients for the MY2.5 turbulence soln. (include this line only if IEVC = 50)",
    "THETA1": "the dissipation term",
    "THETA2": "the vertical diffusion term",
    "I3DSD,": "TO3DSDF, NSPO3DSD",
    "I3DSD": "0 no station 3D temperature, salinity and/or density info is output to unit 41",
    "TO3DSDS": "the number of days after which station 3D temperature, salinity and/or density are written to unit 41.",
    "TO3DSDF": "the number of days after which station 3D temperature, salinity and/or density cease to be written to unit 41.",
    "NSPO3DSD": "the number of time steps at which data is written to unit 41. (i.e., data is output to unit 41 every NSPO3DSD time steps after TO3DSSD.)",
    "NSTA3DD": "number of 3D density stations",
    "X3DS": "– the coordinates of the 3D temperature, salinity, and/or density recording station k, for all NSTA3DD, NSTA3DV or NSTA3DT stations (only include this line if I3DSD, I3DSV or I3DST is not = 0)",
    "I3DSV,": "NSPO3DSV",
    "I3DSV": "2 station 3D velocities are output in binary format",
    "TO3DSVS": "the number of days after which station 3 D velocities are written to unit 42.",
    "TO3DFVF": "the number of days after which station 3 D velocities cease to be written to unit 42.",
    "NSPO3DSV": "the number of time steps at which data is written to unit 42.< (i.e., data is output to unit 42 every NSPO3DSV time steps after TO3DSSV.)",
    "NSTA3DV": "number of 3D velocity stations",
    "I3DST,": "TO3DSTF, NSPO3DST",
    "I3DST": "0 no station 3D turbulence variables output to unit 43",
    "TO3DSTS": "the number of days after which station 3D turbulence variables are written to unit 43.",
    "TO3DSTF": "the number of days after which station 3D turbulence variables cease to be written to unit 43.",
    "NSPO3DST": "the number of time steps at which data is written to unit 43. (i.e., data is output to unit 43 every NSPO3DSV time steps after TO3DSSV.)",
    "NSTA3DT": "number of 3D turbulence stations",
    "I3DGD,": "TO3DGDF, NSPO3DGD",
    "I3DGD": "0 no global 3D temperature, salinity, and/or density info is output to unit 44",
    "TO3DGDS": "the number of days after which global 3D temperature, salinity, and/or density are written to unit 44.",
    "TO3DGDF": "the number of days after which global 3D temperature, salinity, and/or density cease to be written to unit 44.",
    "NSPO3DGD": "the number of time steps at which data is written to unit 44. (i.e., data is output to unit 44 every NSPO3DGD time steps after TO3DSGD.)",
    "I3DGV,": "TO3DGVF, NSPO3DGV",
    "I3DGV": "0 no global 3D velocities are output to unit 45",
    "TO3DGVS": "the number of days after which global 3D velocity data is written to unit 45.",
    "TO3DGVF": "the number of days after which global 3D velocity data ceases to be written to unit 45.",
    "NSPO3DGV": "the number of time steps at which data is written to unit 45. (i.e., data is output to unit 45 every NSPO3DGV time steps after TO3DSGV.)",
    "I3DGT,": "TO3DGTF, NSPO3DGT",
    "I3DGT": "0 no global 3D turbulence variables output to unit 46",
    "TO3DGTS": "the number of days after which global 3D turbulence variables are written to unit 46.",
    "TO3DGTF": "the number of days after which global 3D turbulence variables cease to be written to unit 46.",
    "NSPO3DGT": "the number of time steps at which data is written to unit 46. (i.e., data is output to unit 46 every NSPO3DGT time steps after TO3DSGT.)",
    "RES_BC_FLAG": "Controls the type of boundary conditions used in the 3D baroclinic simulations. Must bethe same as IDEN.",
    "BCFLAG_LNM": "Flag to control the levels of no motion parameterization used in the 3D ADCIRC run.",
    "RBCTIMEINC": "Time interval between data sets for the level of no motion boundary condition data, in seconds.",
    "BCSTATIM": "Starting time (in seconds since ADCIRC cold start) for boundary condition data for the level of no motion boundary condition.",
    "SBCTIMEINC": "Time interval between data sets for the salinity boundary condition data, in seconds.",
    "SBCSTATIM": "Starting time (in seconds since ADCIRC cold start) for boundary condition data for the salinity boundary condition.",
    "TBCTIMEINC": "Time interval between data sets for the temperature boundary condition data, in seconds.",
    "TBCSTATIM": "Starting time (in seconds since ADCIRC cold start) for boundary condition data for the temperature boundary condition.",
    "TTBCTIMEINC": "Time interval between data sets for the surface heat flux boundary condition data, in seconds.",
    "TTBCSTATIM": "Starting time (in seconds since ADCIRC cold start) for boundary condition data for the surface heat flux boundary condition.",
    "BCFLAG_TEMP": "Controls the surface heat flux parameterization used in the 3D ADCIRC simulation with temperature. ADCIRC ignores this parameter unless RES_BC_FLAG is 3 or 4. Currently, there are three options for the surface heat flux boundary (all surface heat flux values are read in from a fort.38 file).",
    "SPONGEDIST": "Controls the sponge layer that allows for a spatial ramp to occur on the wind and advection terms, but it does not vary in time. It starts at zero on the boundary and linearly increases to one over a user-defined distance into the domain. The distance must be given in either m or ft, depending on the units on gravity. The sponge layer is utilized for both the diagnostic and prognostic simulations for the wind terms and all advective terms (momentum and transport equations, if applicable). If SPONGEDIST is not equal to zero, and NOUTGE is not equal to zero, ADCIRC will produce a fulldomain output file that shows the extent of the sponge layer (similar in format to the maxele.63 file) called fort.92.",
    "EQNSTATE": "Indicates the equation of state used to convert the salinity and temperature values into density values.",
    "NLSD": "salinity lateral diffusion coefficient",
    "NVSD": "salinity vertical diffusion coefficient",
    "NLTD": "temperature lateral diffusion coefficient",
    "NVTD": "temperature vertical diffusion coefficient",
    "ALP4": "time stepping coefficient associated with the transport equation terms",
    "Variable": "(fort.41, fort.42, fort.43, fort.44, fort.45, fort.46)",
    "AGRID2": "alphanumeric file identification (<=24 characters). To facilitate organization of files for individual model runs, it is suggested that AGRID2 match AGRID in the Grid and Boundary Information File.",
    "STARTDRY": "start dry code; STARTDRY = -88888 at nodes which will be initialized as dry. It can have any value at other nodes.",
    "DUM1,": "= dummy variables",
    "DACONC": "generic passive scalar 2D depth-averaged concentration field",
    "CONC": "generic passive scalar 3D concentration field",
    "NVN": "number of nodes in vertical, must match NFEN",
    "NVP": "number of nodes in the horizontal grid, must match NP",
    "jki": "node number",
    "NHNN": "horizontal node number",
    "NVNN": "vertical node number",
    "DASIGT": "Sigma T value (kg/m^3) (=density-1000) for a 2DDI run",
    "DATEMP": "Temperature (DEG C) for a 2DDI run",
    "DASALT": "Salinity (PSU) for a 2DDI run",
    "SIGT": "Sigma T value (kg/m^3) (=density-1000)",
    "TEMP": "Temperature (DEG C)",
    "SAL": "Salinity (PSU)",
    "SIGMA": "dimensionless level of the vertical grid node K from -1 (bottom) to +1 (surface)",
    "NumOfNodes": "number of nodes, must match NP from grid file",
    "NAttr": "number of attributes contained in the fort.13 file, must be equal to or greater than NWP from fort.15 file",
    "Units": "physical units (ft, m/s, 1 = unitless)",
    "ValuesPerNode": "number of values at each node for a particular attribute",
    "DefaultAttrVal": "default value(s) for the nodal attribute",
    "NumNodesNotDefaultVal": "number of nodes with non-default values",
    "n": "node number",
    "AttrVal": "nodal attribute value(s)",
    "ESBIN": "elevation (referenced to the geoid) at specified elevation node k. The sequencing is assumed to match what is defined in the elevation specified boundary condition part of the Grid and Boundary Information File.",
    "ETIMINC": "time increment (secs) between consecutive sets of elevation specified boundary condition values contained in this file.",
    "FTIMINC": "time increment (secs) between consecutive sets of normal flow boundary condition values contained in this file.",
    "NFLBN=": "number of flow boundary nodes",
    "QNIN": "normal flow/unit width (e.g., m2/s) at specified normal flow node k. A positive flow/unit width is into the domain and a negative flow/unit width is out of the domain. The sequencing is assumed to match what is defined in the part of the Grid and Boundary Information File specifying non zero normal flow boundaries.",
    "FRIC": "nodal bottom friction coefficient.",
    "IWTIME": "(if NWS =3, 103) time of the wind field in the following integer format: YEAR*1000000 + MONTH*10000 + DAY*100 + HR",
    "PRN": "applied atmospheric pressure at the free surface. Units depend on the specific type of wind input file.",
    "WDIR": "(if NWS = 3, 103) direction wind blows from in deg cw from north",
    "WSPEED": "(if NWS =3, 103) wind speed in m/s",
    "WSX,": "= applied horizontal wind stress in the x,y directions divided by the reference density of water (should be units (length/time)2). An oceanographic convention is used where velocity is positive when it is blowing toward positive coordinate directions.",
    "WVX,": "= applied horizontal wind velocity in the x,y directions. An oceanographic convention is used where velocity is positive when it is blowing toward positive coordinate directions. Units depend on the specific type of wind input file.",
    "WVNX,": "= (if NWS = 4, -4, 104, -104) applied horizontal wind velocity in the x,y directions. An oceanographic convention is used where velocity is positive when it is blowing toward positive coordinate directions. Units are knots.",
    "WVXFN,": "= (if NWS = 6, 106, 7, -7) applied horizontal wind velocity in the x,y directions. An oceanographic convention is used where velocity is positive when it is blowing toward positive coordinate directions. Units are assumed to be m/s",
    "LONB,": "= (if NWS = 10) – number of longitude and latitudes in a global Gaussian Lon/Lat grid (NWS = 10) or ETA-29 grid (NWS = 11), these are specified in the ADCIRC program.",
    "PG": "(if NWS = 10) – surface pressure in m H20.",
    "UG": "(if NWS = 10) – 10 meter U velocity in m/s.",
    "VG": "(if NWS = 10) – 10 meter V velocity in m/s.",
    "PE": "(if NWS = 11) – surface pressure in mbars.",
    "UE": "(if NWS = 11) –10 meter U velocity in m/s.",
    "VE": "(if NWS = 11) – 10 meter V velocity in m/s",
    "NWSET": "(if NWS = 12) – the number of wind/pressure fields to be used; 1 indicates that only the basin scale meteorological field should be used; and 2 indicates that two fields be used (both the basin scale meteorological field and the regional scale meteorological field).",
    "NWBS": "(if NWS = 12) – is useful in cases where the start time of the met data does not coincide with the start time of an ADCIRC run. NWBS represents the time delay between the start of an ADCIRC run and the start of the gridded wind field data, in units of wind time increments. Examples are provided in the notes section for this met file format.",
    "DWM": "(if NWS = 12) – specifies a multiplication factor for the wind velocities. If the velocities should be used as-is, set this factor to 1.0.",
    "comment": "– provenance information, max 1024 characters",
    "pressureWindRelationship": "This character string specifies the method for assigning the barometric pressure, since it is not provided in HWind data. Allowable values are dvorak, knaffzehr, specifiedPc, and background.",
    "hours": "specifies the model time corresponding to the data in file i, in hours since cold start if NWS=15, or in hours since hot start if NWS=-15",
    "centralPressure": "if the pressure-wind relationship was set to specifiedPc, this column specifies the central pressure corresponding to the wind velocity field in file i. Otherwise it is ignored and can be set to -1 to emphasize this.",
    "rampMult": "Multiplier that will be applied to the wind velocities in file i; can be used to provide a meteorological ramp if the hwind data are to be applied long after coldstart when the usual ADCIRC ramp functions are unavailable. Normally set to 1.0.",
    "filename": "The filename of the HWind file i, as downloaded from NOAA HRD. The filename should be enclosed in quotes; this prevents the Fortran library from interpreting embedded “/” characters in full path filenames as record separators.",
    "dvorak": "The central pressure will be assigned by searching the wind field for the maximum wind speed and then plugging it into the formula pc=1015-(Vmax/3.92)**(1/0.644).",
    "knaffzehr": "Same as dvorak except the formula is pc=1010-(Vmax/3.92)**(1/0.76).",
    "specifiedPc": "The central pressure will be linearly interpolated in time from the values provided in the centralPressure(i) column. This allows the use of the BEST track central pressures with the HWind velocities.",
    "background": "This value will cause the entire barometric pressure field to the background pressure.",
    "RSX,": "= applied wave radiation stress in the x,y directions divided by the reference density of water (should be units (length/time)2). An oceanographic convention is used where stress is positive when it is pointed in positive coordinate directions.",
    "SALTAMP": "amplitude of the self attraction/earth tide loading forcing for constituent k and node number JN. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, amplitude is in m, if gravity is in ft/s2, amplitude is in ft.). If ICS=2, gravity must be specified in m/s2 and the amplitude is in m.",
    "SALTPHA": "phase (degrees) of the self attraction/earth tide loading forcing for constituent k and node number JN.",
    "Output": "variable definitions:",
    "EMAG": "Elevation amplitude for constituent k at station j. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, amplitude is in m, if gravity is in ft/s2, amplitude is in ft.). If ICS=2, gravity must be specified in m/s2 and the amplitude is in m. This quantity is computed by the harmonic analysis routines in ADCIRC.",
    "PHASEDE": "Elevation phase (in deg) for constituent k at node or station j. This quantity is computed by the harmonic analysis routines in ADCIRC.",
    "EMAGT": "Elevation amplitude for constituent k at node j. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, amplitude is in m, if gravity is in ft/s2, amplitude is in ft.). If ICS=2, gravity must be specified in m/s2 and the amplitude is in m. This quantity is computed by the harmonic analysis routines in ADCIRC.",
    "UMAG": "X direction velocity amplitude for constituent k at station j. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, amplitude is in m, if gravity is in ft/s2, amplitude is in ft.). If ICS=2, gravity must be specified in m/s2 and the amplitude is in m. This quantity is computed by the harmonic analysis routines in ADCIRC.",
    "PHASEDU": "X – direction velocity phase (in deg) for constituent k at node or station j. This quantity is computed by the harmonic analysis routines in ADCIRC.",
    "VMAG": "Y direction velocity amplitude for constituent k at station j. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, amplitude is in m, if gravity is in ft/s2, amplitude is in ft.). If ICS=2, gravity must be specified in m/s2 and the amplitude is in m. This quantity is computed by the harmonic analysis routines in ADCIRC.",
    "PHASEDV": "Y – direction velocity phase (in deg) for constituent k at node or station j. This quantity is computed by the harmonic analysis routines in ADCIRC.",
    "UMAGT": "X direction velocity amplitude for constituent k at node or station j. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, amplitude is in m, if gravity is in ft/s2, amplitude is in ft.). If ICS=2, gravity must be specified in m/s2 and the amplitude is in m. This quantity is computed by the harmonic analysis routines in ADCIRC.",
    "VMAGT": "Y direction velocity amplitude (in units of distance consistent with gravity) for constituent k at node or station j. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, amplitude is in m, if gravity is in ft/s2, amplitude is in ft.). If ICS=2, gravity must be specified in m/s2 and the amplitude is in m. This quantity is computed by the harmonic analysis routines in ADCIRC.",
    "EAV": "mean elevation in the resynthesized time series",
    "EAVDIF": "",
    "ESQ": "elevation variance in the resynthesized time series",
    "EVADIF": "",
    "UAV": "mean x-velocity in the resynthesized time series",
    "UAVDIF": "",
    "USQ": "x-velocity variance in the resynthesized time series",
    "UVADIF": "",
    "VAV": "mean y-velocity in the resynthesized time series",
    "VAVDIF": "",
    "VSQ": "y-velocity variance in the resynthesized time series",
    "VVADIF": "",
    "TIME": "model time (in seconds) (TIME = STATIM*86400 + IT*DT)",
    "IRTYPE": "the record type (= 1 for elevation files, = 2 for velocity files, and = 3 for 3D velocity file)",
    "NDSETSE": "the number of data sets to be written to fort.63",
    "NDSETSV": "the number of data sets to be written to fort.64",
    "NDSETSW": "the number of data sets to be spooled to fort.73 & 74",
    "NDSETSC": "the number of data sets to be spooled to fort.83",
    "NTRSPE": "the number of data sets to be written to fort.61",
    "NTRSPV": "the number of data sets to be written to fort.62",
    "NTRSPM": "the number of data sets to be spooled to fort.71 or fort.72",
    "NTRSPC": "the number of data sets to be spooled to fort.81",
    "ET00": "surface elevation at NSTAE elevation recording stations. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, elevation is in m, if gravity is in ft/s2, elevation is in ft.). If ICS=2, gravity must be specified in m/s2 and the elevation is in m.",
    "ETA2": "surface elevation at node k at the current time step. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, elevation is in m, if gravity is in ft/s2, elevation is in ft.). If ICS=2, gravity must be specified in m/s2 and the elevation is in m.",
    "ETAMAX": "maximum surface elevation over the entire run at node k. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, elevation is in m, if gravity is in ft/s2, elevation is in ft.). If ICS=2, gravity must be specified in m/s2 and the elevation is in m.",
    "UU00": "x, y velocity at NSTAV velocity recording stations. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, velocity is m/s, if gravity is in ft/s2, velocity is in ft/s). If ICS=2, gravity must be specified in m/s2 and the velocity units are m/s.",
    "UU": "– depth-averaged horizontal velocity",
    "RMP00": "atmospheric surface pressure (m of water) output at NSTAM meteorological recording stations.",
    "RMU00,": "= x,y wind stress (NWS =1, 2, -2) or velocity (NWS = 3, 4, -4, 5, -5, 6, 10, 11) at NSTAM meteorological recording stations. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, velocity is m/s, if gravity is in ft/s2, velocity is in ft/s). If ICS=2, gravity must be specified in m/s2 and the velocity units are m/s.",
    "CC00": "scalar concentration at NSTAC concentration recording stations.",
    "PR2": "atmospheric surface pressure (m of water) output for all nodes in the domain.",
    "WVNXOUT": "= x,y wind stress (NWS =1, 2, -2) or velocity (NWS = 3, 4, -4, 5, -5, 6, 10, 11) or converted from 1-min average wind to 10-min average wind velocity (one2ten=0.8928) multiplied by the wind ramp in m/s (NWS = 8, 19, 20) for all nodes in the domain. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, velocity is m/s, if gravity is in ft/s2, velocity is in ft/s). If ICS=2, gravity must be specified in m/s2 and the velocity units are m/s.",
    "C1": "scalar concentration output for all nodes in domain",
    "Hot": "Files (fort.67, 68)",
    "IT": "model time step number since the beginning of the model run.",
    "ETA1": "surface elevation at node k at the previous time step",
    "ICSTP": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the Scalar Concentration Time Series at Specified Concentration Recording Stations output file.",
    "IESTP": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the Elevation Time Series at Specified Elevation Recording Stations output file.",
    "IPSTP": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the Atmospheric Pressure Time Series at Specified Meteorological Recording Stations output file.",
    "IVSTP": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the Depth-averaged Velocity Time Series at Specified Velocity Recording Stations output file.",
    "IWSTP": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the Wind Velocity Time Series at Specified Meteorological Recording Stations output file.",
    "IGCP": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the Scalar Concentration Time Series at All Nodes in the Model Grid output file.",
    "IGEP": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the Elevation Time Series at All Nodes in the Model Grid output file.",
    "IGPP": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the Atmospheric Pressure Time Series at All Nodes in the Model Grid output file.",
    "IGVP": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the Depth-averaged Velocity Time Series at All Nodes in the Model Grid output file.",
    "IGWP": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the Wind Stress or Velocity Time Series at All Nodes in the Model Grid output file.",
    "noff": "The wet/dry state of element i where 1 indicates an element is categorized as wet on the timestep that the dataset was written while a value of 0 indicates that an element is categorized as dry.",
    "EP": "Scaling parameter that is used to maximize the diagonal dominance of the GWCE system matrix. It is computed within ADCIRC at a cold start or when the GWCE matrix changes (e.g., wetting and drying has occurred).",
    "NSCOUC": "time step counter to determine when the next entry will be written to the Scalar Concentration Time Series at Specified Concentration Recording Stations output file.",
    "NSCOUE": "time step counter to determine when the next entry will be written to the Elevation Time Series at Specified Elevation Recording Stations output file.",
    "NSCOUM": "time step counter to determine when the next entry will be written to the Atmospheric Pressure Time Series at Specified Meteorological Recording Stations and Wind Velocity Time Series at Specified Meteorological Recording Stations output files.",
    "NSCOUV": "time step counter to determine when the next entry will be written to the Depth-averaged Velocity Time Series at Specified Velocity Recording Stations output file.",
    "NSCOUGC": "time step counter to determine when the next entry will be written to the Scalar Concentration Time Series at All Nodes in the Model Grid output file.",
    "NSCOUGE": "time step counter to determine when the next entry will be written to the Elevation Time Series at All Nodes in the Model Grid output file.",
    "NSCOUGW": "time step counter to determine when the next entry will be written to the Atmospheric Pressure Time Series at All Nodes in the Model Grid and Wind Stress or Velocity Time Series at All Nodes in the Model Grid output files.",
    "NSCOUGV": "time step counter to determine when the next entry will be written to the Depth-averaged Velocity Time Series at All Nodes in the Model Grid output file.",
    "N3DSD": "time step counter to determine when the next entry will be written to the 3D Density, Temperature and/or Salinity at Specified Recording Stations (fort.41) output file.",
    "I3DSDRec": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the 3D Density, Temperature and/or Salinity at Specified Recording Stations (fort.41) output file.",
    "N3DSV": "time step counter to determine when the next entry will be written to the 3D Velocity at Specified Recording Stations (fort.42) output file.",
    "I3DSVRec": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the 3D Velocity at Specified Recording Stations (fort.42) output file.",
    "N3DST": "time step counter to determine when the next entry will be written to the 3D Turbulence at Specified Recording Stations (fort.43) output file.",
    "I3DSTRec": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the 3D Turbulence at Specified Recording Stations (fort.43) output file.",
    "N3DGD": "time step counter to determine when the next entry will be written to the 3D Density, Temperature and/or Salinity at All Nodes in the Model Grid (fort.44) output file.",
    "I3DGDRec": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the 3D Density, Temperature and/or Salinity at All Nodes in the Model Grid (fort.44) output file.",
    "N3DGV": "time step counter to determine when the next entry will be written to the 3D Velocity at All Nodes in the Model Grid (fort.45) output file.",
    "I3DGVRec": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the 3D Velocity at All Nodes in the Model Grid (fort.45) output file.",
    "N3DGT": "time step counter to determine when the next entry will be written to the 3D Turbulence at All Nodes in the Model Grid (fort.46) output file.",
    "I3DGTRec": "line number (for ASCII output) or record number (for binary output) of the most recent entry in the 3D Turbulence at All Nodes in the Model Grid (fort.46) output file.",
    "DUU": "DVV(k) – Dispersion terms",
    "BSX": "– x, y bottom stresses",
    "VIDBCPDX": "– vertically integrated Baroclinic pressure",
    "REAL": "u velocity component for global output",
    "AIMAG": "v velocity component for global output",
    "WZ": "vertical velocity for global output. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, velocity is m/s, if gravity is in ft/s2, velocity is in ft/s). If ICS=2, gravity must be specified in m/s2 and the velocity units are m/s.",
    "Q20": "previous time step value of Q2",
    "HA": "coefficients in the least squares matrix used for the harmonic analysis",
    "CH1": "depth-averaged scalar concentration value at node k at the current time step",
    "ELAV": "sum of elevations computed by ADCIRC, at every node k in the model grid, over all time steps since harmonic analysis means and variance checking has begun",
    "ELVA": "sum of squares of elevations computed by ADCIRC, at every node k in the model grid, over all time steps since harmonic analysis means and variance checking has begun",
    "FNAM8": "the second 8 characters of FNAME(k)",
    "GLOELV": "harmonic analysis load vectors for elevation at all nodes in the model grid",
    "GLOULV": "harmonic analysis load vectors for depth-averaged u velocity at all nodes in the model grid",
    "GLOVLV": "harmonic analysis load vectors for depth-averaged v velocity at all nodes in the model grid",
    "ICALL": "number of times the harmonic analysis has been updated",
    "ICHA": "time step counter to determine when the next update will be made to the harmonic analysis.",
    "IHARIND": "indicator of whether any harmonic analysis will be performed during the model run.",
    "ITUD": "model time step when the harmonic analysis was last updated",
    "MM": "2*NFREQ – NF",
    "NF": "indicator of whether the steady frequency is included in the harmonic analysis (NF = 1, steady is included; NF = 0, steady is not included).",
    "NTSTEPS": "number of time steps since harmonic analysis means and variance checking has begun",
    "NZ": "indicator of whether the steady frequency is included in the harmonic analysis (NZ = 0, steady is included; NZ = 1, steady is not included).",
    "STAELV": "harmonic analysis load vectors for elevation at elevation recording stations",
    "STAULV": "harmonic analysis load vectors for depth-averaged u velocity at velocity recording stations",
    "STAVLV": "harmonic analysis load vectors for depth-averaged v velocity at velocity recording stations",
    "TIMEUD": "model time when the harmonic analysis was last updated",
    "XVELAV": "sum of depth-averaged u velocities computed by ADCIRC, at every node k in the model grid, over all time steps since harmonic analysis means and variance checking has begun",
    "XVELVA": "sum of squares of depth-averaged u velocities computed by ADCIRC, at every node k in the model grid, over all time steps since harmonic analysis means and variance checking has begun",
    "YVELAV": "sum of depth-averaged v velocities computed by ADCIRC, at every node k in the model grid, over all time steps since harmonic analysis means and variance checking has begun",
    "YVELVA": "sum of squares of depth-averaged v velocities computed by ADCIRC, at every node k in the model grid, over all time steps since harmonic analysis means and variance checking has begun",
    "NDSET3DSD": "number of data sets to be written to fort.41",
    "SALSTA": "Salinity (PSU) at a specified recording station",
    "TEMPSTA": "Temperature (DEG C) at a specified recording station",
    "NDSET3DSV": "number of data sets to be written to fort.42",
    "WZSTA": "vertical velocity for station output. If ICS=1, units are determined by the units of gravity (G) specified in the fort.15 file (eg. if G is in m/s2, velocity is m/s, if gravity is in ft/s2, velocity is in ft/s). If ICS=2, gravity must be specified in m/s2 and the velocity units are m/s.",
    "NDSET3DST": "number of data sets to be written to fort.43",
    "q20STA": "turbulent kinetic energy for station output",
    "ISTA": "mixing length for station output",
    "EVSTA": "Spatially constant horizontal eddy viscosity for the momentum equations (units of length2/time) for station output",
    "q20": "turbulent kinetic energy",
    "l": "mixing length",
    "EV": "– horizontal eddy viscosity for the momentum equations (units of length2/time) for global output",
    "NDSET3DGD": "the number of data sets to be written to fort.44",
    "NDSET3DGV": "the number of data sets to be written to fort.45",
    "NDSET3DGT": "the number of data sets to be written to fort.46",
    "NTF": "temperature boundary condition file type (this file is not supported yet).",
    "NCPROJ": "Project Title (what is in the file).",
    "NCINST": "Project Institution (where file was produced).",
    "NCSOUR": "Project Source (how it was produced, eg. instrument type).",
    "NCHIST": "Project History (audit trail of processing operations).",
    "NCREF": "Project References (pointers to publications, web documentation).",
    "NCCOM": "Project Comments (any other comments about the file).",
    "NCHOST": "Project Host.",
    "NCCONV": "Conventions.",
    "NCCONT": "Contact Information.",
    "NCDATE": "The format of NCDATE must be as follows so that ADCIRC can create netcdf files that comply with the CF standard: yyyy-MM-dd hh:mm:ss tz. For example, if the cold start date/time of the run is midnight UTC on 1 May 2010, the NCDATE parameter should be set to 2010-05-01 00:00:00 UTC.",
    "WindDragLimit": "This parameter controls the ceiling on the wind drag coefficient. The default value is 0.0035. Another commonly used value is 0.002.",
    "DragLawString": "This character string controls the formulation used to calculate the nodal wind drag coefficients on the water surface from the nodal wind speed. The default value “Garratt” specifies the formula WindDragCoefficient = 0.001d0 * (0.75d0 + 0.067d0 * WindSpeed). Alternatively, for tropical cyclones, setting the ‘DragLawString’ equal to “Powell” causes a more complex formulation to be used, where different formulas apply to different storm quadrants. If ice coverage data have been specified via appropriate specification of the NWS parameter, the wind drag coefficient formulation can also be set to IceCube (the default) or RaysIce. Complete details are available in the documentation of the Ice Coverage Input Files (fort.25, fort.225, fort.227).",
    "rhoAir": "Used to set the density of air; the default value is 1.15 kg/m^3.",
    "waveCoupling": "a Fortran namelist that can be used to control the magnitude of the winds that are passed to coupled wave models.",
    "WindWaveMultiplier": "This multiplier is applied after the winds have been read in by ADCIRC and time interpolated (if necessary) but without ADCIRC’s ramp function. Since ADCIRC normally requires 10 minute averaged winds, many of ADCIRC’s meteorological reading subroutines also include a conversion from the time averaging period of the source data (if such time averaging is a standard for that data type) to a 10 minute average. In these cases, the multiplier is applied to the derived 10 minute averaged wind velocity values, rather than the raw values from the original meteorological forcing file.",
    "timeBathyControl": "a Fortran namelist used to specify parameters related to simulations that have time varying bathymetry.",
    "NDDT": "Controls whether time varying bathymetry will be used, and if- so, the spatial extent and time reference of the data in the- time varying bathymetry input file (fort.141). See description below for more details.",
    "BTIMINC": "Time increment (in seconds) between time varying bathymetry datasets in the time varying bathymetry (fort.141) file.",
    "BCHGTIMINC": "Time increment (seconds) over which bathymetry changes during a BTIMINC interval.",
    "tau0var": "tau0 value written out at every node in the fort.90 file",
    "subdomainModeling": "is a Fortran namelist used to activate subdomain modeling, which gives analysts the capability to define a small subdomain nested within a much larger domain. The fulldomain can thenbe run once, generating boundary conditions for the nested subdomain. These boundary conditions can then be used over and over for different internal configurations of the subdomain without having to run the larger domain again. Please see the ADCIRC documentation on subdomain modeling for further details.",
    "subdomainOn": "This logical variable activates subdomain modeling when set to ‘.true.’. The default value of ‘.false.’ will be used if the subdomainModeling namelist is not found in the fort.15 file.",
    "wetDryControl": "is a Fortran namelist that can be used to turn on output of (1) the nodal wet/dry state to the nodecode.63 file and/or (2) the elemental wet/dry state to the noff.100 file. It can also be used to deactivate the use of elemental wet/dry state in the continuity and momentum equations by forcing all elements of the NOFF array to be 1.",
    "inundationOutputControl": "is a Fortran namelist that can be used to activate the production of a set of inundation-related output files, including initiallydry.63, everdried.63, inundationtime.63, maxinundepth.63, and endrisinginun.63. It is also used to set the inunThresh variable, i.e., the threshold of water depth above local ground level at which normally dry land is considered inundated (to eliminate trivial inundation levels from consideration).",
    "TVWControl": "is a Fortran namelist that can be used to activate the time varying weirs feature (with use_TVW), specify the name of the input file that specifies the behavior of the time varying weir(s) (TVW_file), and the schedule for output of weir height to the fort.77 file (nout_TVW, touts_TVW, toutf_TVW, and nspool_TVW).",
    "outputNodeCode": "Logical variable activates the production of the nodecode.63 file for nodal wet/dry state when set to ‘.true.’. The default value is ‘.false.’. The nodecode.63 output file is produced in ASCII format with the same structure as the fort.63 file (with the exception that the node code value is an integer) and on the same schedule as the fort.63 file. A nodal value of 1 in the nodecode.63 file indicates that the node is wet on the timestep that the data set was written, while a value of 0 indicates that the node is dry on the timestep that the data set was written. In order to be included in the computations of water surface elevation and velocity, a node must be wet.",
    "outputNOFF": "Logical variable activates the production of the noff.100 file for elemental wet/dry state when set to ‘.true.’. The default value is ‘.false.’. The noff.100 output file is produced in ASCII format with a structure similar to the fort.63 file, with the following exceptions: (a) the noff value is an integer; and (b) the noff array is elementally based, so the number of values for each time snap is equal to the number of elements, rather than the number of nodes. When outputNOFF is set to .true., the noff.100 file will be produced on the same schedule as the fort.63 file. An elemental value of 1 in the noff.100 file indicates that the element is wet on the timestep that the data set was written, while a value of 0 indicates that the element is dry on the timestep that the data set was written. In order to be included in the computations of water surface elevation and velocity, an element and all three of its nodes must be wet.",
    "noffActive": "NOFF is the name of elemental array in ADCIRC that holds the elemental wet/dry state. The noffActive logical variable can be used to completely disable the elemental wet dry state by setting NOFF to 1 (wet), always and everywhere, when set to ‘.false.’. The default value is ‘.true.’.",
    "inundationOutput": "Logical variable activates the production of the the inundation output files (consisting of initiallydry.63, everdried.63, inundationtime.63, maxinundepth.63, and endrisinginun.63) when set to ‘.true.’. The default value is ‘.false.’.",
    "inunThresh": "Numerical value of water surface elevation above local ground level that marks the threshold at which normally dry land is considered inundated. The default value is 0.6m.",
    "use_TVW": "Logical variable that activates the time varying weirs capability when set to ‘.true.’. The default value is ‘.false.’.",
    "TVW_file": "Character string used to specify the name of the time varying weirs input file. The default name is ‘fort.tvw’. This file defines the location(s) and schedule(s) or trigger(s) for weir elevation changes. If the TVW_file is not found, ADCIRC writes an informational message to the screen and to the fort.16 (log) file that the file was not found. The run will then continue, but all weirs will be static.",
    "nout_TVW": "Integer that activates the production of the fort.77 output file as well as specifying its format; setting nout_TVW to zero turns off the production of the fort.77 output file while setting it to positive or negative 1, 3, 4, or 5 produce files in ASCII, netCDF3, sparse ASCII, or netCDF4, respectively. Due to the sparse nature of the weir height output data, sparse ASCII format (nout_TVW=4) is recommended. If use_TVW is set to .true. but this parameter nout_TVW is not set at all, then nout_TVW is set to the same value as the file format specifier for the fort.63 file (NOUTGE). The data stored in the fort.77 file represent the change in the weir height (in meters, positive upward) compared to the weir height specified in the ADCIRC mesh file, rather than the absolute height of the weir at a particular time.",
    "touts_TVW": "Time in days since cold start after which output to the fort.77 file will start.",
    "toutf_TVW": "Time in days since cold start when output to the fort.77 file will end.",
    "nspool_TVW": "Time step increment at which output will be written to the fort.77 file when the ADCIRC model time is between touts_TVW and toutf_TVW (in days since cold start).",
    "TVW": "Nodal array that contains the difference between the current weir elevations and their canonical elevations as specified in the ADCIRC mesh file (fort.14).",
    "NSTAE2": "Number of stations specified in the Elevation Station location file (elev_sta.151)",
    "NSTAV2": "Number of stations specified in the Velocity Station location file (vel_sta.151)",
    "NSTAC2": "Number of stations specified in the Concentration Station location file (conc_sta.151)",
    "NSTAM2": "Number of stations specified in the Meteorological Station location file (met_sta.151)",
    "initiallydry": "a value given to node k at cold start based on whether the node was dry or wet. If it is dry the value is 1, if it is wet, the value is 0.",
    "everdried": "value at node k of -99999.0 if node k is dried at any time during the simulations, and 1 if it remains wet..",
    "driedtime": "total time in seconds that node k was dry during the simulation (0 if it remains wet)",
    "endrisinginun": "if node k had rising inundation levels at the end of a simulation it is flagged with an integer value of 1, otherwise it is given an integer value of 0",
    "maxinundepth": "the peak inundation depth at node k (in meters) above ground that occurred during the simulation",
    "maxinundepth_time": "the time of the the peak inundation depth at the node in seconds since the cold start",
    "inundationtime": "the total accumulated time in seconds that node k was inundated beyond the threshold. Periods of inundation are counted toward the total time, even if they are not contiguous.",
    "inundationtime_onset": "time of onset of inundation beyond the threshold at node k in seconds since cold start. The time of onset data are useful in the context of real time model guidance for decision making.",
    "nodecode": "The wet/dry state of node k where 1 indicates a node is categorized as wet on the timestep that the dataset was written while a value of 0 indicates that a node is categorized as dry."
}
